Revit 2026 API

# FileDialogGetSelectedModelPath Method

---

Returns the selected file path chosen by the user.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ModelPath GetSelectedModelPath()
```
```vb
Public Function GetSelectedModelPath As ModelPath
```
```cpp
public:
ModelPath^ GetSelectedModelPath()
```
```fsharp
member GetSelectedModelPath : unit -> ModelPath
```

#### Return Value

ModelPath The selected file path, or  if the dialog has not been shown or selection was cancelled.

#### Reference

FileDialog Class

Autodesk.Revit.UI Namespace